<details><summary>This plan is out of date. A new plan has been performed.</summary>

> 
> **Terraform plan** (preview) ran in [2 seconds](https://github.com/evanyeung-clear/terraform-ci/actions/runs/16632983033).
> ```
> terraform plan -no-color -input=false -var-file=terraform.tfvars.json
> ```
> 
> #### Diff of changes
> ```diff
> + okta_user.test1 will be created
> 
> ```
> 
> <details>
> <summary>Plan: 1 to add, 0 to change, 0 to destroy.
> </summary>
> 
> ```
> Terraform used the selected providers to generate the following execution
> plan. Resource actions are indicated with the following symbols:
>   + create
> 
> Terraform will perform the following actions:
> 
>   # okta_user.test1 will be created
>   + resource "okta_user" "test1" {
>       + custom_profile_attributes = (known after apply)
>       + email                     = "example@example.com"
>       + expire_password_on_create = false
>       + first_name                = "John"
>       + id                        = (known after apply)
>       + last_name                 = "Smith"
>       + login                     = "example@example.com"
>       + raw_status                = (known after apply)
>       + skip_roles                = false
>       + status                    = "ACTIVE"
>     }
> 
> Plan: 1 to add, 0 to change, 0 to destroy.
> 
> ```
> </details>
> 
</details>